RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_cordic.h
/***************************************************************************//**
* \file cy_cordic.h
* \version 2.10
*
*  This file provides constants and parameter values for
*  the CORDIC driver.
*
********************************************************************************
* \copyright
* Copyright 2023 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#if !defined(CY_CORDIC_H)
#define CY_CORDIC_H


/**
* \addtogroup group_cordic
* \{
* The CORDIC driver provides an easy method to access the CORDIC IP block registers
* and provides simple functionalities for calculating the Trigonometric functions,
* hyperbolic functions and Park Transform.
*
* The functions and other declarations used in this driver are in cy_cordic.h.
* You can include cy_pdl.h to get access to all functions and declarations in the PDL.
*
* \section group_cordic_configuration Configuration Considerations
*
* The CORDIC driver provides the simplest way to calculate the various functions.
* No configuration is needed.
*
* \section group_cordic_more_information More Information
*
* Refer to the technical reference manual (TRM) and the device datasheet.
*
* \section group_cordic_changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td >2.10</td>
*     <td>Macro definition of CY_CORDIC_ID changed.</td>
*     <td>Bug Fixes.</td>
*   </tr>
*   <tr>
*     <td>2.0</td>
*     <td>A few APIs are turned to inline APIs. And result parameter is moved
*         as return parameter instead, for a few APIs. </td>
*     <td>To improve performance.</td>
*   </tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
* </table>
*
* \defgroup group_cordic_macros Macros
* \defgroup group_cordic_data_structures Data Structures
* \defgroup group_cordic_enumerated_types Enumerated Types
* \defgroup group_cordic_functions Functions
*/

#include "cy_device.h"

#if defined (CY_IP_MXCORDIC)

#include <stddef.h>
#include "cy_syslib.h"

#if defined(__cplusplus)
extern "C" {
#endif

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 8, \
'Intentional typecast from uint32_t to int32_t.')
CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.1', 10, \
'Intentional use of unsigned type with the operator >>.')

/**
* \addtogroup group_cordic_macros
* \{
*/

/** The driver major version */
#define CY_CORDIC_DRV_VERSION_MAJOR       2U

/** The driver minor version */
#define CY_CORDIC_DRV_VERSION_MINOR       10U

/** The CORDIC driver ID */
#define CY_CORDIC_ID               CY_PDL_DRV_ID(0x63U)

/** Reciprocal of Circular gain in CY_CORDIC_CIRCULAR_GAIN format ((2^23)/1.646760258121) */
#define CY_CORDIC_CIRCULAR_GAIN       (0x4DBA76U)

/** Reciprocal of Hyperbolic gain in CY_CORDIC_HYPERBOLIC_GAIN format
((2^22)/0.828159360960) */
#define CY_CORDIC_HYPERBOLIC_GAIN     (0x4D47A1U)

/** Scaling factor : ((2^15) / 0.828159360960), where 0.828159360960 is the hyperbolic gain */
#define CY_CORDIC_Q15_SCALING_FACTOR    (39568UL)

/** Is operating mode valid */
#define CY_CORDIC_IS_OPERATING_MODE_VALID(mode)      ((CY_CORDIC_OPERATING_MODE_CIRCULAR  == (mode)) || \
                                                       (CY_CORDIC_OPERATING_MODE_HYPERBOLIC == (mode)))

/** Is  rotvec mode valid */
#define CY_CORDIC_IS_ROTVEC_MODE_VALID(mode)         ((CY_CORDIC_ROTVEC_MODE_VECTORING  == (mode)) || \
                                                       (CY_CORDIC_ROTVEC_MODE_ROTATION == (mode)))

/** In circular function, |angle_in_radians| is less than or equal to integer value representing 1.74 radians;
The 1.74 angle in radians is mapped to the integer value(4646111) using: ((angle * ((2^23)/pi)) << 8)
*/
#define CY_CORDIC_IS_CIRCULAR_ROTATION_ANGLE_VALID(angle)              (((-(4646111)) <= (angle >> 8)) && \
                                                                       ((angle >> 8) <= (4646111)))

/** Angle range for Tangent operation [(-2^23) / 2, (2^23 - 1) / 2] */
#define CY_CORDIC_IS_TAN_ANGLE_VALID(angle)              (((-(1 << 23) / 2) <= (angle >> 8)) && \
                                                           ((angle >> 8) <= (((1 << 23) - 1) / 2)))

/** In hyperbolic function, |angle_in_radians| is less than or equal to integer value representing 1.11 radians;
The 1.11 angle in radians is mapped to the integer value(2963898) using: ((angle * ((2^23)/pi)) << 8)
*/
#define CY_CORDIC_IS_HYPERBOLIC_ROTATION_ANGLE_VALID(angle)              (((-(2963898)) <= (angle >> 8)) && \
                                                                       ((angle >> 8) <= (2963898)))


/** Is input within the range [(-2^23), (2^23 - 1)] for vectoring mode operations */
#define CY_CORDIC_IS_INPUT_VALID(x)              (((-(1 << 23)) <= (x)) && \
                                                       ((x) <= ((1 << 23) - 1)))

/** Number of cordic iterations */
#define CY_CORDIC_NUMBER_OF_ITERATIONS         (7U)

/** \cond INTERNAL */

#define CY_IS_BASE_VALID(base)                         (NULL != base)

#define CY_CORDIC_IS_INPUT_NON_ZERO(x)                 (x != 0)

#define CY_CORDIC_IS_INTR_VALID(intr, mask)            ( 0UL == ((intr) & ((uint32_t) ~(mask))) )

#define CY_CORDIC_INTR_MASK                            (MXCORDIC_INTR_MASK_CDEOC_Msk | MXCORDIC_INTR_MASK_CDERR_Msk)

#define CY_CORDIC_INTR_END_OF_CALCULATION  MXCORDIC_INTR_CDEOC_Msk

#define CY_CORDIC_INTR_ERROR_EVENT MXCORDIC_INTR_CDERR_Msk

