RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_cordic.h
/* X and Y are divided by MPS value 2 in the Cy_CORDIC_ParkTransformNB to avoid overflow.
X and Y are divided by 4 using CY_CORDIC_MPS_CORRECTION in the Cy_CORDIC_GetParkResult to refactor
the results */
#define CY_CORDIC_MPS_CORRECTION_FACTOR         (4)

/** \endcond */

/**
* \defgroup group_cordic_macros_callback_events CORDIC Callback Events
* Macros to check CORDIC events passed by \ref cy_cb_cordic_handle_events_t callback.
* Each event is encoded in a separate bit and therefore it is possible to
* notify about multiple events.
* \{
*/
/**
* Indicates the end of calculation event.
*/
#define CY_CORDIC_END_OF_CALCULATION_EVENT     (0x00000001UL)

/**
* Indicates the error event.
*/
#define CY_CORDIC_ERROR_EVENT                  (0x00000002UL)

/** \} group_cordic_macros_callback_events */

/** \} group_cordic_macros */


/*******************************************************************************
*                              Type Definitions
*******************************************************************************/
/**
* \addtogroup group_cordic_data_structures
* \{
*/

/**
 * This typedef is used for Input and Output Data representation in blocking & non-blocking functions.
 * CY_CORDIC_Q31_t => 1 Signed bit, 0 Integer bits, 31 fraction bits.
 */
typedef int32_t CY_CORDIC_Q31_t;

/**
 * This typedef is used for Input Data representation in blocking & non-blocking functions.
 * CY_CORDIC_8Q23_t => 1 Signed bit, 8 Integer bits, 23 fraction bits.
 */
typedef int32_t CY_CORDIC_8Q23_t;

/**
 * This typedef is used for Output Data representation in blocking & non-blocking functions.
 * CY_CORDIC_20Q11_t => 1 Signed bit, 20 Integer bits, 11 fraction bits.
 */
typedef int32_t CY_CORDIC_20Q11_t;

/**
 * This typedef is used for Output Data representation in blocking & non-blocking functions.
 * CY_CORDIC_1Q30_t => 1 Signed bit, 1 Integer bits, 30 fraction bits.
 */
typedef int32_t CY_CORDIC_1Q30_t;


/**
* Provides the typedef for the callback function called in the
* \ref Cy_CORDIC_Interrupt to notify the user about occurrences of
* \ref group_cordic_macros_callback_events.
*/
typedef void (* cy_cb_cordic_handle_events_t)(uint32_t event);


/** CORDIC context structure.
* All fields for the context structure are internal. Firmware never reads or
* writes these values. Firmware allocates the structure and provides the
* address of the structure to the driver in function calls. Firmware must
* ensure that the defined instance of this structure remains in scope
* while the drive is in use.
*/
typedef struct cy_stc_cordic_context
{
    /**
    * The pointer to an event callback that is called when any of
    * \ref group_cordic_macros_callback_events occurs.
    */
    cy_cb_cordic_handle_events_t cbEvents;
}cy_stc_cordic_context_t;

/** Park Transform results */
typedef struct cy_stc_cordic_parkTransform_result
{
    int32_t   parkTransformIq; /**< Iq */
    int32_t   parkTransformId; /**< Id */
}
cy_stc_cordic_parkTransform_result_t;

/** \} group_cordic_data_structures */


/***************************************
*       Enumerations
***************************************/
/**
* \addtogroup group_cordic_enumerated_types
* \{
*/
/** This enum has the return values of the CORDIC driver */
typedef enum
{
    CY_CORDIC_SUCCESS       = 0x00U,                                     /**< Operation completed successfully */
    CY_CORDIC_BAD_PARAM     = CY_CORDIC_ID | CY_PDL_STATUS_ERROR | 0x01u, /**< One or more invalid parameters */
} cy_en_cordic_status_t;


/** CORDIC the Circular/Hyperbolic/Linear Operating Modes */
typedef enum
{
    CY_CORDIC_OPERATING_MODE_CIRCULAR       = 0x1U,             /**< Circular Operating Mode */
    CY_CORDIC_OPERATING_MODE_HYPERBOLIC     = 0x3U,             /**< Hyperbolic Operating Mode */
}cy_en_cordic_operating_mode_t;

/** Rotation Vectoring Modes */
typedef enum
{
    CY_CORDIC_ROTVEC_MODE_VECTORING      = 0x0U,             /**< Vectoring Mode */
    CY_CORDIC_ROTVEC_MODE_ROTATION       = 0x1U,             /**< Rotation Mode */
}cy_en_cordic_rotvec_mode_t;

/** X and Y MPS - Magnitude Pre-scalar */
typedef enum
{
    CY_CORDIC_DIVIDE_BY_1      = 0x0U,             /**< MPS - Divide X and Y by 1 */
    CY_CORDIC_DIVIDE_BY_2      = 0x1U,             /**< MPS - Divide X and Y by 2 */
    CY_CORDIC_DIVIDE_BY_4      = 0x2U,             /**< MPS - Divide X and Y by 4 */
}cy_en_cordic_mps_t;

/** \} group_cordic_enumerated_types */


/***************************************
*        Function Prototypes
***************************************/
/**
* \addtogroup group_cordic_functions
* \{
*/


/*******************************************************************************
* Function Name: Cy_CORDIC_Enable
****************************************************************************//**
*
* Enables CORDIC IP.
*
* \param base
* The pointer to the CORDIC instance.
*
*******************************************************************************/
__STATIC_INLINE void Cy_CORDIC_Enable(MXCORDIC_Type *base);

/*******************************************************************************
* Function Name: Cy_CORDIC_Disable
****************************************************************************//**
*
* Disables CORDIC IP.
*
* \param base
* The pointer to the CORDIC instance.
*
*******************************************************************************/
__STATIC_INLINE void Cy_CORDIC_Disable(MXCORDIC_Type *base);


/*******************************************************************************
* Function Name: Cy_CORDIC_IsBusy
****************************************************************************//**
*
* Checks if there is any computation is currently in progress.
*
* \param base
* The pointer to the CORDIC instance.
*
* \return
* true: calculation in progress
* false: no calculation in progress
*
*******************************************************************************/
__STATIC_INLINE bool Cy_CORDIC_IsBusy(MXCORDIC_Type *base);


/*******************************************************************************
* Function Name: Cy_CORDIC_CosNB
****************************************************************************//**
*
* Computes the Cosine for the given angle in radians.
*
* \param base
* The pointer to the CORDIC instance.
*
* \param angle_in_radians
* The angle in radians.
* \note
*  - The input angle should be mapped to the integer value using:
*    angle_in_radians = ((angle * ((2^23)/pi)) << 8)
*  - In circular function, |angle_in_radians| is less than or equal to integer value representing 1.74 radians
*
* \note
* This is a non-blocking function.
* \ref Cy_CORDIC_GetCosResult should be called to obtain the result.
*
*******************************************************************************/
__STATIC_INLINE void Cy_CORDIC_CosNB(MXCORDIC_Type *base, CY_CORDIC_Q31_t angle_in_radians);


