RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_cordic.h
/*******************************************************************************
* Function Name: Cy_CORDIC_SinNB
****************************************************************************//**
*
* Computes the Sine for the given angle in radians.
*
* \param base
* The pointer to the CORDIC instance.
*
* \param angle_in_radians
* The angle in radians.
* \note
*  - The input angle should be mapped to the integer value using:
*    angle_in_radians = ((angle * ((2^23)/pi)) << 8)
*  - In circular function, |angle_in_radians| is less than or equal to integer value representing 1.74 radians
*
* \note
* This is a non-blocking function.
* \ref Cy_CORDIC_GetSinResult should be called to obtain the result.
*
*******************************************************************************/
__STATIC_INLINE void Cy_CORDIC_SinNB(MXCORDIC_Type *base, CY_CORDIC_Q31_t angle_in_radians);


/*******************************************************************************
* Function Name: Cy_CORDIC_TanNB
****************************************************************************//**
*
* Computes the Tangent for the given angle in radians.
*
* \param base
* The pointer to the CORDIC instance.
*
* \param angle_in_radians
* The angle in radians.
* \note
*  - The input angle should be mapped to the integer value using:
*    angle_in_radians = ((angle * ((2^23)/pi)) << 8)
*  - In circular function, |angle_in_radians| is less than or equal to integer value representing 1.74 radians
*
* \note
* This is a non-blocking function.
* \ref Cy_CORDIC_GetTanResult should be called to obtain the result.
*
*******************************************************************************/
__STATIC_INLINE void Cy_CORDIC_TanNB(MXCORDIC_Type *base, CY_CORDIC_Q31_t angle_in_radians);


/*******************************************************************************
* Function Name: Cy_CORDIC_ArcTanNB
****************************************************************************//**
*
* Computes the Arc Tangent for the given value (y/x).
*
* \param base
* The pointer to the CORDIC instance.
*
* \param y
* The numerator value.
*
* \param x
* The denominator value.
*
* \note
*  - The input parameters x and y should be left shifted by 8 bits: x = x << 8; y = y << 8;
*  - This is a non-blocking function.
*  - \ref Cy_CORDIC_GetArcTanResult should be called to obtain the result.
*
*******************************************************************************/
__STATIC_INLINE void Cy_CORDIC_ArcTanNB(MXCORDIC_Type *base, CY_CORDIC_8Q23_t x, CY_CORDIC_8Q23_t y);


/*******************************************************************************
* Function Name: Cy_CORDIC_CoshNB
****************************************************************************//**
*
* Computes the Hyperbolic Cosine for the given angle in radians.
*
* \param base
* The pointer to the CORDIC instance.
*
* \param angle_in_radians
* The angle in radians.
* \note
*  - The input angle should be mapped to the integer value using:
*    angle_in_radians = ((angle * ((2^23)/pi)) << 8)
*  - In hyperbolic function, |angle_in_radians| is less than or equal to integer value representing 1.11 radians
*
* \note
* This is a non-blocking function.
* \ref Cy_CORDIC_GetCoshResult should be called to obtain the result.
*
*******************************************************************************/
__STATIC_INLINE void Cy_CORDIC_CoshNB(MXCORDIC_Type *base, CY_CORDIC_Q31_t angle_in_radians);


/*******************************************************************************
* Function Name: Cy_CORDIC_SinNB
****************************************************************************//**
*
* Computes the Hyperbolic Sine for the given angle in radians.
*
* \param base
* The pointer to the CORDIC instance.
*
* \param angle_in_radians
* The angle in radians.
* \note
*  - The input angle should be mapped to the integer value using:
*    angle_in_radians = ((angle * ((2^23)/pi)) << 8)
*  - In hyperbolic function, |angle_in_radians| is less than or equal to integer value representing 1.11 radians
*
* \note
* This is a non-blocking function.
* \ref Cy_CORDIC_GetSinhResult should be called to obtain the result.
*
*******************************************************************************/
__STATIC_INLINE void Cy_CORDIC_SinhNB(MXCORDIC_Type *base, CY_CORDIC_Q31_t angle_in_radians);


/*******************************************************************************
* Function Name: Cy_CORDIC_TanNB
****************************************************************************//**
*
* Computes the Hyperbolic Tangent for the given angle in radians.
*
* \param base
* The pointer to the CORDIC instance.
*
* \param angle_in_radians
* The angle in radians.
* \note
*  - The input angle should be mapped to the integer value using:
*    angle_in_radians = ((angle * ((2^23)/pi)) << 8)
*  - In hyperbolic function, |angle_in_radians| is less than or equal to integer value representing 1.11 radians
*
* \note
* This is a non-blocking function.
* \ref Cy_CORDIC_GetTanhResult should be called to obtain the result.
*
*******************************************************************************/
__STATIC_INLINE void Cy_CORDIC_TanhNB(MXCORDIC_Type *base, CY_CORDIC_Q31_t angle_in_radians);


/*******************************************************************************
* Function Name: Cy_CORDIC_ArcTanhNB
****************************************************************************//**
*
* Computes the Hyperbolic Arc Tangent for the given value (y/x).
*
* \param base
* The pointer to the CORDIC instance.
*
* \param y
* The numerator value.

* \param x
* The denominator value.
*
* \note
* The input parameters x and y should be left shifted by 8 bits: x = x << 8; y = y << 8;
* This is a non-blocking function.
* \ref Cy_CORDIC_GetArcTanhResult should be called to obtain the result.
*
*******************************************************************************/
__STATIC_INLINE void Cy_CORDIC_ArcTanhNB(MXCORDIC_Type *base, CY_CORDIC_8Q23_t x, CY_CORDIC_8Q23_t y);


