RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_cordic.h
/*******************************************************************************
* Function Name: Cy_CORDIC_GetCosResult
****************************************************************************//**
*
* Returns the result of Cosine operation.
*
* \param base
* The pointer to the CORDIC instance.
*
* \return
* \ref CY_CORDIC_Q31_t
* \note
* The result should be scaled: (((result) >> 8) / (2^23))
*
*******************************************************************************/
__STATIC_INLINE CY_CORDIC_Q31_t Cy_CORDIC_GetCosResult(MXCORDIC_Type *base);


/*******************************************************************************
* Function Name: Cy_CORDIC_GetSinResult
****************************************************************************//**
*
* Returns the result of Sine operation.
*
* \param base
* The pointer to the CORDIC instance.
*
* \return
* \ref CY_CORDIC_Q31_t
* \note
* The result should be scaled: (((result) >> 8) / (2^23))
*
*******************************************************************************/
__STATIC_INLINE CY_CORDIC_Q31_t Cy_CORDIC_GetSinResult(MXCORDIC_Type *base);


/*******************************************************************************
* Function Name: Cy_CORDIC_GetTanResult
****************************************************************************//**
*
* Returns the result of Tangent operation.
*
* \param base
* The pointer to the CORDIC instance.
*
* \return
* \ref CY_CORDIC_20Q11_t
* \note
* The result should be scaled: ((result) / (2^11))
*
*******************************************************************************/
__STATIC_INLINE CY_CORDIC_20Q11_t Cy_CORDIC_GetTanResult(MXCORDIC_Type *base);


/*******************************************************************************
* Function Name: Cy_CORDIC_GetArcTanResult
****************************************************************************//**
*
* Returns the result of Arc Tangent operation.
*
* \param base
* The pointer to the CORDIC instance.
*
* \return
* \ref CY_CORDIC_Q31_t
* \note
* The result should be scaled: ((result >> 8) * (pi / (2^23)))
*
*******************************************************************************/
__STATIC_INLINE CY_CORDIC_Q31_t Cy_CORDIC_GetArcTanResult(MXCORDIC_Type *base);


/*******************************************************************************
* Function Name: Cy_CORDIC_GetCoshResult
****************************************************************************//**
*
* Returns the result of Hyperbolic Cosine operation.
*
* \param base
* The pointer to the CORDIC instance.
*
* \return
* \ref CY_CORDIC_1Q30_t
* \note
* The result should be scaled: (((result) >> 8) / (2^22))
*
*******************************************************************************/
__STATIC_INLINE CY_CORDIC_1Q30_t Cy_CORDIC_GetCoshResult(MXCORDIC_Type *base);


/*******************************************************************************
* Function Name: Cy_CORDIC_GetSinhResult
****************************************************************************//**
*
* Returns the result of Hyperbolic Sine operation.
*
* \param base
* The pointer to the CORDIC instance.
*
* \return
* \ref CY_CORDIC_1Q30_t
* \note
* The result should be scaled: (((result) >> 8) / (2^22))
*
*******************************************************************************/
__STATIC_INLINE CY_CORDIC_1Q30_t Cy_CORDIC_GetSinhResult(MXCORDIC_Type *base);


/*******************************************************************************
* Function Name: Cy_CORDIC_GetTanhResult
****************************************************************************//**
*
* Returns the result of Hyperbolic Tangent operation.
*
* \param base
* The pointer to the CORDIC instance.
*
* \return
* \ref CY_CORDIC_20Q11_t
* \note
* The result should be scaled: ((result) / (2^11))
*
*******************************************************************************/
__STATIC_INLINE CY_CORDIC_20Q11_t Cy_CORDIC_GetTanhResult(MXCORDIC_Type *base);


/*******************************************************************************
* Function Name: Cy_CORDIC_GetArcTanhResult
****************************************************************************//**
*
* Returns the result of Hyperbolic Arc Tangent operation.
*
* \param base
* The pointer to the CORDIC instance.
*
* \return
* \ref CY_CORDIC_1Q30_t
* \note
* The result should be scaled: ((result >> 8) * (pi / (2^23)))
*
*******************************************************************************/
__STATIC_INLINE CY_CORDIC_Q31_t Cy_CORDIC_GetArcTanhResult(MXCORDIC_Type *base);


/*******************************************************************************
* Function Name: Cy_CORDIC_ParkTransformNB
****************************************************************************//**
*
* Computes the Park Transform.
*
* \param base
* The pointer to the CORDIC instance.
*
* \param Vref_AngleQ31
* The rotor angle value in radians.

* \param I_Alpha_1Q31
* The current I_Alpha value.
*
* \param I_Beta_1Q31
* The current I_Beta value.
*
* \note
*  - This is a non-blocking function.
*  - The input parameters should be scaled as: ((I_Alpha_1Q31 * 0x800000) << 8); ((I_Beta_1Q31 * 0x800000) << 8);
*    ((angle_in_radians * ((2^23) / pi)) << 8)
*  - \ref Cy_CORDIC_GetParkResult should be called to obtain the result.
*
*******************************************************************************/
__STATIC_INLINE void Cy_CORDIC_ParkTransformNB(MXCORDIC_Type *base, CY_CORDIC_Q31_t Vref_AngleQ31, CY_CORDIC_Q31_t I_Alpha_1Q31, CY_CORDIC_Q31_t I_Beta_1Q31);


/*******************************************************************************
* Function Name: Cy_CORDIC_GetParkResult
****************************************************************************//**
*
* Returns Park Transform results.
*
* \param base
* The pointer to the CORDIC instance.
*
* \param ptr
* The pointer to the computed values of Park Transform.
* \note
* The result should be scaled as: ((float32_t)ptr.x /(float32_t)(2^23 - 1))
*
*******************************************************************************/
__STATIC_INLINE void Cy_CORDIC_GetParkResult(MXCORDIC_Type *base, cy_stc_cordic_parkTransform_result_t *ptr);


