RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_cordic.h
/*******************************************************************************
* Function Name: Cy_CORDIC_ClearZ
****************************************************************************//**
*
* Clears the CORDIC Z Data register.
*
* \param base
* The pointer to the CORDIC instance.
*
*******************************************************************************/
__STATIC_INLINE void Cy_CORDIC_ClearZ(MXCORDIC_Type *base);


/*******************************************************************************
* Function Name: Cy_CORDIC_SetMode
****************************************************************************//**
*
* Configures the operating modes.
*
* \param base
* The pointer to the CORDIC instance.
*
* \param opmode
* Specifies the Circular/Hyperbolic/Linear mode.

* \param rotvec
* Specifies the Rotation/Vectoring mode.
*
*******************************************************************************/
__STATIC_INLINE void Cy_CORDIC_SetMode(MXCORDIC_Type *base, cy_en_cordic_operating_mode_t opmode, cy_en_cordic_rotvec_mode_t rotvec);


/*******************************************************************************
* Function Name: Cy_CORDIC_Cos
****************************************************************************//**
*
* Computes the Cosine for the given angle in radians.
*
* \param base
* The pointer to the CORDIC instance.
*
* \param angle_in_radians
* The angle in radians.
*
* \return
* The computed Cosine value.
* \ref CY_CORDIC_Q31_t
*
* \note
*  - This is a blocking function.
*  - The input angle should be mapped to the integer value using:
*    angle_in_radians = ((angle * ((2^23)/pi)) << 8)
*  - In circular function, |angle_in_radians| is less than or equal to integer value representing 1.74 radians
*  - The result should be scaled- as: (((result) >> 8) / (2^23)
*
*******************************************************************************/
__STATIC_INLINE CY_CORDIC_Q31_t Cy_CORDIC_Cos(MXCORDIC_Type *base, CY_CORDIC_Q31_t angle_in_radians);


/*******************************************************************************
* Function Name: Cy_CORDIC_Sin
****************************************************************************//**
*
* Computes the Sine for the given angle in radians.
*
* \param base
* The pointer to the CORDIC instance.
*
* \param angle_in_radians
* The angle in radians.
*
* \return
* The computed Sine value.
* \ref CY_CORDIC_Q31_t
*
* \note
*  - This is a blocking function.
*  - The input angle should be mapped to the integer value using:
*    angle_in_radians = ((angle * ((2^23)/pi)) << 8)
*  - In circular function, |angle_in_radians| is less than or equal to integer value representing 1.74 radians
*  - The result should be scaled as: (((result) >> 8) / (2^23)
*
*******************************************************************************/
__STATIC_INLINE CY_CORDIC_Q31_t Cy_CORDIC_Sin(MXCORDIC_Type *base, CY_CORDIC_Q31_t angle_in_radians);


/*******************************************************************************
* Function Name: Cy_CORDIC_Tan
****************************************************************************//**
*
* Computes the Tangent for the given angle in radians.
*
* \param base
* The pointer to the CORDIC instance.
*
* \param angle_in_radians
* The angle in radians.
*
* \return
* The computed Tangent value.
* \ref CY_CORDIC_20Q11_t
*
* \note
*  - This is a blocking function.
*  - The input angle should be mapped to the integer value using:
*    angle_in_radians = ((angle * ((2^23)/pi)) << 8)
*  - In circular function, |angle_in_radians| is less than or equal to integer value representing 1.74 radians
*  - The result should be scaled as: ((result) / (2^11))
*
*******************************************************************************/
CY_CORDIC_20Q11_t Cy_CORDIC_Tan(MXCORDIC_Type *base, CY_CORDIC_Q31_t angle_in_radians);


/*******************************************************************************
* Function Name: Cy_CORDIC_ArcTan
****************************************************************************//**
*
* Computes the Arc Tangent for the given value (y/x).
*
* \param base
* The pointer to the CORDIC instance.
*
* \param y
* The numerator value.
*
* \param x
* The denominator value.
*
* \return
* The computed Arc Tangent value.
* \ref CY_CORDIC_Q31_t
*
* \note
*  - This is a blocking function.
*  - The input parameters x and y should be left shifted by 8 bits: x = x << 8; y = y << 8;
*  - The result should be scaled as: ((result >> 8) * (pi / (2^23)))
*
*******************************************************************************/
__STATIC_INLINE CY_CORDIC_Q31_t Cy_CORDIC_ArcTan(MXCORDIC_Type *base, CY_CORDIC_8Q23_t x, CY_CORDIC_8Q23_t y);


/*******************************************************************************
* Function Name: Cy_CORDIC_Cosh
****************************************************************************//**
*
* Computes the Hyperbolic Cosine for the given angle in radians.
*
* \param base
* The pointer to the CORDIC instance.
*
* \param angle_in_radians
* The angle in radians.
*
* \return
* The computed Hyperbolic Cosine value.
* \ref CY_CORDIC_1Q30_t
*
* \note
*  - This is a blocking function.
*  - The input angle should be mapped to the integer value using:
*    angle_in_radians = ((angle * ((2^23)/pi)) << 8)
*  - In hyperbolic function, |angle_in_radians| is less than or equal to integer value representing 1.11 radians
*  - The result should be scaled as: (((result) >> 8) / (2^22)
*
*******************************************************************************/
__STATIC_INLINE CY_CORDIC_1Q30_t Cy_CORDIC_Cosh(MXCORDIC_Type *base, CY_CORDIC_Q31_t angle_in_radians);


/*******************************************************************************
* Function Name: Cy_CORDIC_Sinh
****************************************************************************//**
*
* Computes the Hyperbolic Hyperbolic Sine for the given angle in radians.
*
* \param base
* The pointer to the CORDIC instance.
*
* \param angle_in_radians
* The angle in radians.
*
* \return
* The computed Hyperbolic Sine value.
* \ref CY_CORDIC_1Q30_t
*
* \note
*  - This is a blocking function.
*  - The input angle should be mapped to the integer value using:
*    angle_in_radians = ((angle * ((2^23)/pi)) << 8)
*  - In hyperbolic function, |angle_in_radians| is less than or equal to integer value representing 1.11 radians
*  - The result should be scaled as: (((result) >> 8) / (2^22)
*
*******************************************************************************/
__STATIC_INLINE CY_CORDIC_1Q30_t Cy_CORDIC_Sinh(MXCORDIC_Type *base, CY_CORDIC_Q31_t angle_in_radians);


