RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_cordic.h
/*******************************************************************************
* Function Name: Cy_CORDIC_Cosh
****************************************************************************//**
*
* Computes the Hyperbolic Tangent for the given angle in radians.
*
* \param base
* The pointer to the CORDIC instance.
*
* \param angle_in_radians
* The angle in radians.
*
* \return
* The computed Hyperbolic Tangent value.
* \ref CY_CORDIC_20Q11_t
*
* \note
*  - This is a blocking function.
*  - The input angle should be mapped to the integer value using:
*    angle_in_radians = ((angle * ((2^23)/pi)) << 8)
*  - In hyperbolic function, |angle_in_radians| is less than or equal to integer value representing 1.11 radians
*  - The result should be scaled as: ((result) / (2^11))
*
*******************************************************************************/
CY_CORDIC_20Q11_t Cy_CORDIC_Tanh(MXCORDIC_Type *base, CY_CORDIC_Q31_t angle_in_radians);


/*******************************************************************************
* Function Name: Cy_CORDIC_ArcTanh
****************************************************************************//**
*
* Computes the Hyperbolic Arc Tangent for the given value (y/x).
*
* \param base
* The pointer to the CORDIC instance.
*
* \param y
* The numerator value.
*
* \param x
* The denominator value.
*
* \return
* The computed Hyperbolic Arc Tangent value.
* \ref CY_CORDIC_Q31_t
*
* \note
* - The input parameters x and y should be left shifted by 8 bits: x = x << 8; y = y << 8;
* - This is a blocking function.
* - The result should be scaled as: ((result >> 8) * (pi / (2^23)))
*
*******************************************************************************/
__STATIC_INLINE CY_CORDIC_Q31_t Cy_CORDIC_ArcTanh(MXCORDIC_Type *base, CY_CORDIC_8Q23_t x, CY_CORDIC_8Q23_t y);


/*******************************************************************************
* Function Name: Cy_CORDIC_Sqrt
****************************************************************************//**
*
* Computes the Square root of the given value.
*
* \param base
* The pointer to the CORDIC instance.
*
* \param x
* The input value.
*
* \return
* Square root of the given value.
*
* \note
*  - This is a blocking function.
*  - The input parameter x of type float should be converted to Q31: (x * 0x80000000) + 0.5F
*  - The result should be scaled from  Q31 to float : (*result / 0x80000000)
*
*******************************************************************************/
uint32_t Cy_CORDIC_Sqrt(MXCORDIC_Type *base, uint32_t x);


/*******************************************************************************
* Function Name: Cy_CORDIC_GetInterruptStatus
****************************************************************************//**
*
* Returns the interrupt cause register.
*
* \param base
* The pointer to the CORDIC instance.
*
* \return
* The current status of the interrupt sources. Each constant is a bit field
* value. The value returned may have multiple bits set to indicate the
* current status.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_CORDIC_GetInterruptStatus(MXCORDIC_Type *base);


/*******************************************************************************
* Function Name: Cy_CORDIC_ClearInterrupt
****************************************************************************//**
*
* Clears the interrupt sources in the interrupt cause register.
*
* \param base
* The pointer to the CORDIC instance.
*
* \param interruptMask
* The interrupt sources to be cleared.
*
*******************************************************************************/
__STATIC_INLINE void Cy_CORDIC_ClearInterrupt(MXCORDIC_Type *base, uint32_t interruptMask);


/*******************************************************************************
* Function Name: Cy_CORDIC_SetInterrupt
****************************************************************************//**
*
* Sets the interrupt sources in the interrupt set register.
*
* \param base
* The pointer to the CORDIC instance.
*
* \param interruptMask
* The interrupt sources to set in the interrupt set register.
*
*******************************************************************************/
__STATIC_INLINE void Cy_CORDIC_SetInterrupt(MXCORDIC_Type *base, uint32_t interruptMask);


/*******************************************************************************
* Function Name: Cy_CORDIC_GetInterruptMask
****************************************************************************//**
*
* Returns the interrupt mask register. This register specifies which
* bits from the interrupt cause register can trigger an interrupt event.
*
* \param base
* The pointer to the CORDIC instance.
*
* \return
* Enabled interrupt sources.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_CORDIC_GetInterruptMask(MXCORDIC_Type *base);


/*******************************************************************************
* Function Name: Cy_CORDIC_SetInterruptMask
****************************************************************************//**
*
* Writes interrupt mask register.
* This register specifies which bits from the interrupt cause register
* can trigger an interrupt event.
*
* \param base
* The pointer to the CORDIC instance.
*
* \param interruptMask
* The interrupt sources to set in the interrupt set register.
*
*******************************************************************************/
__STATIC_INLINE void Cy_CORDIC_SetInterruptMask(MXCORDIC_Type *base, uint32_t interruptMask);


/*******************************************************************************
* Function Name: Cy_CORDIC_GetInterruptStatusMasked
****************************************************************************//**
*
* Returns the interrupt masked register. This register contains a
* logical AND of corresponding bits from the interrupt cause and mask
* registers.
* This function is intended to be used in the interrupt service routine to
* identify which of enabled interrupt sources caused the interrupt
* event.
*
* \param base
* The pointer to the CORDIC instance.
*
* \return
* The current status of enabled interrupt sources.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_CORDIC_GetInterruptStatusMasked(MXCORDIC_Type *base);


