RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_cordic.h
__STATIC_INLINE void Cy_CORDIC_TanhNB(MXCORDIC_Type *base, CY_CORDIC_Q31_t angle_in_radians)
{
    /* Input parameters verification */
    CY_ASSERT_L1(CY_IS_BASE_VALID(base));
    CY_ASSERT_L2(CY_CORDIC_IS_HYPERBOLIC_ROTATION_ANGLE_VALID(angle_in_radians));

    MXCORDIC_CON(base) = _VAL2FLD(MXCORDIC_CON_MODE, CY_CORDIC_OPERATING_MODE_HYPERBOLIC) |
                         _VAL2FLD(MXCORDIC_CON_ROTVEC, CY_CORDIC_ROTVEC_MODE_ROTATION)    |
                         _VAL2FLD(MXCORDIC_CON_N_ITER, CY_CORDIC_NUMBER_OF_ITERATIONS);
    MXCORDIC_CORDX(base) = _VAL2FLD(MXCORDIC_CORDX_DATA, CY_CORDIC_HYPERBOLIC_GAIN);
    MXCORDIC_CORDY(base) = 0UL;
    MXCORDIC_CORDZ(base) = (uint32_t)angle_in_radians;
}


/* TBD: What limits should be checked for x and y */
__STATIC_INLINE void Cy_CORDIC_ArcTanhNB(MXCORDIC_Type *base, CY_CORDIC_8Q23_t x, CY_CORDIC_8Q23_t y)
{
    CY_ASSERT_L1(CY_IS_BASE_VALID(base));
    CY_ASSERT_L1(CY_CORDIC_IS_INPUT_NON_ZERO(x));
    CY_ASSERT_L2(CY_CORDIC_IS_INPUT_VALID(x));
    CY_ASSERT_L2(CY_CORDIC_IS_INPUT_VALID(y));

    MXCORDIC_CON(base) = _VAL2FLD(MXCORDIC_CON_MODE, CY_CORDIC_OPERATING_MODE_HYPERBOLIC) |
                         _VAL2FLD(MXCORDIC_CON_ROTVEC, CY_CORDIC_ROTVEC_MODE_VECTORING)   |
                         _VAL2FLD(MXCORDIC_CON_N_ITER, CY_CORDIC_NUMBER_OF_ITERATIONS);
    MXCORDIC_CORDX(base) = (uint32_t)x;
    MXCORDIC_CORDY(base) = (uint32_t)y;
    MXCORDIC_CORDZ(base) = 0UL;
}


__STATIC_INLINE CY_CORDIC_Q31_t Cy_CORDIC_GetCosResult(MXCORDIC_Type *base)
{
    return ((CY_CORDIC_Q31_t)MXCORDIC_CORRX(base));
}


__STATIC_INLINE CY_CORDIC_Q31_t Cy_CORDIC_GetSinResult(MXCORDIC_Type *base)
{
    return ((CY_CORDIC_Q31_t)MXCORDIC_CORRY(base));
}


__STATIC_INLINE CY_CORDIC_20Q11_t Cy_CORDIC_GetTanResult(MXCORDIC_Type *base)
{
    return (CY_CORDIC_20Q11_t)((((CY_CORDIC_Q31_t)MXCORDIC_CORRY(base)) >> ((int32_t)MXCORDIC_CORRY_RESULT_Pos)) /
                (((CY_CORDIC_Q31_t)MXCORDIC_CORRX(base)) >> ((int32_t)MXCORDIC_CORRX_RESULT_Pos) >> 11UL));
}


__STATIC_INLINE CY_CORDIC_Q31_t Cy_CORDIC_GetArcTanResult(MXCORDIC_Type *base)
{
    return ((CY_CORDIC_Q31_t)MXCORDIC_CORRZ(base));
}


__STATIC_INLINE CY_CORDIC_1Q30_t Cy_CORDIC_GetCoshResult(MXCORDIC_Type *base)
{
    return ((CY_CORDIC_Q31_t)MXCORDIC_CORRX(base));

}


__STATIC_INLINE CY_CORDIC_1Q30_t Cy_CORDIC_GetSinhResult(MXCORDIC_Type *base)
{
    return ((CY_CORDIC_Q31_t)MXCORDIC_CORRY(base));
}


__STATIC_INLINE CY_CORDIC_20Q11_t Cy_CORDIC_GetTanhResult(MXCORDIC_Type *base)
{
    return (CY_CORDIC_20Q11_t)((((CY_CORDIC_Q31_t)MXCORDIC_CORRY(base)) >> ((int32_t)MXCORDIC_CORRY_RESULT_Pos)) /
             (((CY_CORDIC_Q31_t)MXCORDIC_CORRX(base)) >> ((int32_t)MXCORDIC_CORRX_RESULT_Pos) >> 11UL));
}


__STATIC_INLINE CY_CORDIC_Q31_t Cy_CORDIC_GetArcTanhResult(MXCORDIC_Type *base)
{
    return ((int32_t)MXCORDIC_CORRZ(base));
}


__STATIC_INLINE void Cy_CORDIC_ParkTransformNB(MXCORDIC_Type *base, CY_CORDIC_Q31_t Vref_AngleQ31, CY_CORDIC_Q31_t I_Alpha_1Q31, CY_CORDIC_Q31_t I_Beta_1Q31)
{
    /* Input parameters verification */
    CY_ASSERT_L1(CY_IS_BASE_VALID(base));

    MXCORDIC_CON(base) = _VAL2FLD(MXCORDIC_CON_MODE, CY_CORDIC_OPERATING_MODE_CIRCULAR) |
                         _VAL2FLD(MXCORDIC_CON_ROTVEC, CY_CORDIC_ROTVEC_MODE_ROTATION)  |
                         _VAL2FLD(MXCORDIC_CON_MPS, CY_CORDIC_DIVIDE_BY_4)  |
                         _VAL2FLD(MXCORDIC_CON_N_ITER, CY_CORDIC_NUMBER_OF_ITERATIONS);

    MXCORDIC_CORDX(base) = (uint32_t) I_Beta_1Q31;
    MXCORDIC_CORDY(base) = (uint32_t) I_Alpha_1Q31;
    MXCORDIC_CORDZ(base) = (uint32_t)Vref_AngleQ31;
}


CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.3', 2, \'Intentional typecast from uint32_t to int32_t.')
__STATIC_INLINE void Cy_CORDIC_GetParkResult(MXCORDIC_Type *base, cy_stc_cordic_parkTransform_result_t *ptr)
{
    /* Input parameters verification */
    CY_ASSERT_L1(CY_IS_BASE_VALID(base));
    CY_ASSERT_L1(CY_IS_BASE_VALID(ptr));

    ptr->parkTransformIq = CY_CORDIC_MPS_CORRECTION_FACTOR * (((int32_t)MXCORDIC_CORRX(base)) >> MXCORDIC_CORRX_RESULT_Pos);
    ptr->parkTransformId = CY_CORDIC_MPS_CORRECTION_FACTOR * (((int32_t)MXCORDIC_CORRY(base)) >> MXCORDIC_CORRY_RESULT_Pos);
}
CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.3')


__STATIC_INLINE void Cy_CORDIC_ClearZ(MXCORDIC_Type *base)
{
    MXCORDIC_CORDZ(base) = 0UL;
}


__STATIC_INLINE void Cy_CORDIC_SetMode(MXCORDIC_Type *base, cy_en_cordic_operating_mode_t opmode, cy_en_cordic_rotvec_mode_t rotvec)
{
    /* Input parameters verification */
    CY_ASSERT_L1(CY_IS_BASE_VALID(base));
    CY_ASSERT_L3(CY_CORDIC_IS_OPERATING_MODE_VALID(opmode));
    CY_ASSERT_L3(CY_CORDIC_IS_ROTVEC_MODE_VALID(rotvec));

    MXCORDIC_CON(base) = _VAL2FLD(MXCORDIC_CON_MODE, opmode)    |
                         _VAL2FLD(MXCORDIC_CON_ROTVEC, rotvec)  |
                         _VAL2FLD(MXCORDIC_CON_N_ITER, CY_CORDIC_NUMBER_OF_ITERATIONS);
}


__STATIC_INLINE CY_CORDIC_Q31_t Cy_CORDIC_Cos(MXCORDIC_Type *base, CY_CORDIC_Q31_t angle_in_radians)
{
    /* Input parameters verification */
    CY_ASSERT_L1(CY_IS_BASE_VALID(base));
    CY_ASSERT_L2(CY_CORDIC_IS_CIRCULAR_ROTATION_ANGLE_VALID(angle_in_radians));

    MXCORDIC_CON(base) = _VAL2FLD(MXCORDIC_CON_MODE, CY_CORDIC_OPERATING_MODE_CIRCULAR) |
                         _VAL2FLD(MXCORDIC_CON_ROTVEC, CY_CORDIC_ROTVEC_MODE_ROTATION)  |
                         _VAL2FLD(MXCORDIC_CON_N_ITER, CY_CORDIC_NUMBER_OF_ITERATIONS);
    MXCORDIC_CORDX(base) = _VAL2FLD(MXCORDIC_CORDX_DATA, CY_CORDIC_CIRCULAR_GAIN);
    MXCORDIC_CORDY(base) = 0UL;
    MXCORDIC_CORDZ(base) = (uint32_t)angle_in_radians;

    return ((CY_CORDIC_Q31_t)MXCORDIC_CORRX(base));
}


__STATIC_INLINE CY_CORDIC_Q31_t Cy_CORDIC_Sin(MXCORDIC_Type *base, CY_CORDIC_Q31_t angle_in_radians)
{
    /* Input parameters verification */
    CY_ASSERT_L1(CY_IS_BASE_VALID(base));
    CY_ASSERT_L2(CY_CORDIC_IS_CIRCULAR_ROTATION_ANGLE_VALID(angle_in_radians));

    MXCORDIC_CON(base) = _VAL2FLD(MXCORDIC_CON_MODE, CY_CORDIC_OPERATING_MODE_CIRCULAR) |
                         _VAL2FLD(MXCORDIC_CON_ROTVEC, CY_CORDIC_ROTVEC_MODE_ROTATION)  |
                         _VAL2FLD(MXCORDIC_CON_N_ITER, CY_CORDIC_NUMBER_OF_ITERATIONS);
    MXCORDIC_CORDX(base) = _VAL2FLD(MXCORDIC_CORDX_DATA, CY_CORDIC_CIRCULAR_GAIN);
    MXCORDIC_CORDY(base) = 0UL;
    MXCORDIC_CORDZ(base) = (uint32_t)angle_in_radians;

    return ((CY_CORDIC_Q31_t)MXCORDIC_CORRY(base));
}


__STATIC_INLINE CY_CORDIC_Q31_t Cy_CORDIC_ArcTan(MXCORDIC_Type *base, CY_CORDIC_8Q23_t x, CY_CORDIC_8Q23_t y)
{
    /* Input parameters verification */
    CY_ASSERT_L1(CY_IS_BASE_VALID(base));
    CY_ASSERT_L1(CY_CORDIC_IS_INPUT_NON_ZERO(x));
    CY_ASSERT_L2(CY_CORDIC_IS_INPUT_VALID(x));
    CY_ASSERT_L2(CY_CORDIC_IS_INPUT_VALID(y));

