RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_cordic.h
    MXCORDIC_CON(base) = _VAL2FLD(MXCORDIC_CON_MODE, CY_CORDIC_OPERATING_MODE_CIRCULAR) |
                         _VAL2FLD(MXCORDIC_CON_ROTVEC, CY_CORDIC_ROTVEC_MODE_VECTORING) |
                         _VAL2FLD(MXCORDIC_CON_N_ITER, CY_CORDIC_NUMBER_OF_ITERATIONS);
    MXCORDIC_CORDX(base) = (uint32_t)x;
    MXCORDIC_CORDY(base) = (uint32_t)y;
    MXCORDIC_CORDZ(base) = 0UL;

    return ((CY_CORDIC_Q31_t)MXCORDIC_CORRZ(base));
}


__STATIC_INLINE CY_CORDIC_1Q30_t Cy_CORDIC_Cosh(MXCORDIC_Type *base, CY_CORDIC_Q31_t angle_in_radians)
{
    /* Input parameters verification */
    CY_ASSERT_L1(CY_IS_BASE_VALID(base));
    CY_ASSERT_L2(CY_CORDIC_IS_HYPERBOLIC_ROTATION_ANGLE_VALID(angle_in_radians));

    MXCORDIC_CON(base) = _VAL2FLD(MXCORDIC_CON_MODE, CY_CORDIC_OPERATING_MODE_HYPERBOLIC) |
                         _VAL2FLD(MXCORDIC_CON_ROTVEC, CY_CORDIC_ROTVEC_MODE_ROTATION)    |
                         _VAL2FLD(MXCORDIC_CON_N_ITER, CY_CORDIC_NUMBER_OF_ITERATIONS);
    MXCORDIC_CORDX(base) = _VAL2FLD(MXCORDIC_CORDX_DATA, CY_CORDIC_HYPERBOLIC_GAIN);
    MXCORDIC_CORDY(base) = 0UL;
    MXCORDIC_CORDZ(base) = (uint32_t)angle_in_radians;

    return ((CY_CORDIC_Q31_t)MXCORDIC_CORRX(base));
}


__STATIC_INLINE CY_CORDIC_1Q30_t Cy_CORDIC_Sinh(MXCORDIC_Type *base, CY_CORDIC_Q31_t angle_in_radians)
{
    /* Input parameters verification */
    CY_ASSERT_L1(CY_IS_BASE_VALID(base));
    CY_ASSERT_L2(CY_CORDIC_IS_HYPERBOLIC_ROTATION_ANGLE_VALID(angle_in_radians));

    MXCORDIC_CON(base) = _VAL2FLD(MXCORDIC_CON_MODE, CY_CORDIC_OPERATING_MODE_HYPERBOLIC) |
                         _VAL2FLD(MXCORDIC_CON_ROTVEC, CY_CORDIC_ROTVEC_MODE_ROTATION)    |
                         _VAL2FLD(MXCORDIC_CON_N_ITER, CY_CORDIC_NUMBER_OF_ITERATIONS);
    MXCORDIC_CORDX(base) = _VAL2FLD(MXCORDIC_CORDX_DATA, CY_CORDIC_HYPERBOLIC_GAIN);
    MXCORDIC_CORDY(base) = 0UL;
    MXCORDIC_CORDZ(base) = (uint32_t)angle_in_radians;

    return ((CY_CORDIC_Q31_t)MXCORDIC_CORRY(base));
}


__STATIC_INLINE CY_CORDIC_Q31_t Cy_CORDIC_ArcTanh(MXCORDIC_Type *base, CY_CORDIC_8Q23_t x, CY_CORDIC_8Q23_t y)
{
    /* Input parameters verification */
    CY_ASSERT_L1(CY_IS_BASE_VALID(base));
    CY_ASSERT_L1(CY_CORDIC_IS_INPUT_NON_ZERO(x));
    CY_ASSERT_L2(CY_CORDIC_IS_INPUT_VALID(x));
    CY_ASSERT_L2(CY_CORDIC_IS_INPUT_VALID(y));

    MXCORDIC_CON(base) = _VAL2FLD(MXCORDIC_CON_MODE, CY_CORDIC_OPERATING_MODE_HYPERBOLIC) |
                         _VAL2FLD(MXCORDIC_CON_ROTVEC, CY_CORDIC_ROTVEC_MODE_VECTORING)   |
                         _VAL2FLD(MXCORDIC_CON_N_ITER, CY_CORDIC_NUMBER_OF_ITERATIONS);
    MXCORDIC_CORDX(base) = (uint32_t)x;
    MXCORDIC_CORDY(base) = (uint32_t)y;
    MXCORDIC_CORDZ(base) = 0UL;

    return ((CY_CORDIC_Q31_t)MXCORDIC_CORRZ(base));
}


__STATIC_INLINE uint32_t Cy_CORDIC_GetInterruptStatus(MXCORDIC_Type *base)
{
    return (MXCORDIC_INTR(base));
}


__STATIC_INLINE void Cy_CORDIC_ClearInterrupt(MXCORDIC_Type *base, uint32_t interruptMask)
{
    CY_ASSERT_L2(CY_CORDIC_IS_INTR_VALID(interruptMask, CY_CORDIC_INTR_MASK));

    MXCORDIC_INTR(base) = interruptMask;
}


__STATIC_INLINE void Cy_CORDIC_SetInterrupt(MXCORDIC_Type *base, uint32_t interruptMask)
{
    CY_ASSERT_L2(CY_CORDIC_IS_INTR_VALID(interruptMask, CY_CORDIC_INTR_MASK));

    MXCORDIC_INTR_SET(base) = interruptMask;
}


__STATIC_INLINE uint32_t Cy_CORDIC_GetInterruptMask(MXCORDIC_Type *base)
{
    return (MXCORDIC_INTR_MASK(base));
}


__STATIC_INLINE void Cy_CORDIC_SetInterruptMask(MXCORDIC_Type *base, uint32_t interruptMask)
{
    CY_ASSERT_L2(CY_CORDIC_IS_INTR_VALID(interruptMask, CY_CORDIC_INTR_MASK));

    MXCORDIC_INTR_MASK(base) = interruptMask;
}


__STATIC_INLINE uint32_t Cy_CORDIC_GetInterruptStatusMasked(MXCORDIC_Type *base)
{
    return (MXCORDIC_INTR_MASKED(base));
}

__STATIC_INLINE void Cy_CORDIC_RegisterCallback(MXCORDIC_Type *base, cy_cb_cordic_handle_events_t callback, cy_stc_cordic_context_t *context)
{
    /* Suppress a compiler warning about unused variables */
    (void) base;

    context->cbEvents = callback;
}
/** \} group_cordic_functions */

CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.8')
CY_MISRA_BLOCK_END('MISRA C-2012 Rule 10.1')

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXCORDIC */

#endif /* CY_CORDIC_H */

/** \} group_cordic */

/* [] END OF FILE */
